Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.SurfaceResolutionOutOfRange Property
 Pixel size is out of range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceResolutionOutOfRange { get; }
Public Shared ReadOnly Property SurfaceResolutionOutOfRange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceResolutionOutOfRange {
	FailureDefinitionId^ get ();
}
static member SurfaceResolutionOutOfRange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace